In [1]:
# Import Libraries and Dependencies
import pandas as pd
from pathlib import Path

### 1. Combine and Clean the Data
#### Import CSVs

In [2]:
# Read the CSV files into DataFrames.
# Import data
asa_path_2020 = Path('Resources/athletic_sales_2020.csv')
asa_path_2021 = Path('Resources/athletic_sales_2021.csv')

In [3]:
# Read in data 
asa_2020_data = pd.read_csv(asa_path_2020)
asa_2021_data = pd.read_csv(asa_path_2021)

In [4]:
# Display the 2020 sales DataFrame
asa_2020_data.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [5]:
# Display the 2021 sales DataFrame
asa_2021_data.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [6]:
# Check the 2020 sales data types.
asa_2020_data.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [7]:
# Check the 2021 sales data types.
asa_2021_data.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [8]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_asa_rows = pd.concat([asa_2020_data, asa_2021_data], axis="rows", join="inner")
combined_asa_rows
#combined_asa_data = as_2020_df.join(
#   as_2021_df.set_index(["", ""]),
#    on=["", ""],
#    how="inner",
#    lsuffix ="_2020",
#    rsuffix ="_2021")

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
8341,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,Online
8342,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,Outlet
8343,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,Online
8344,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,55,125,68750,17187.50,Outlet
8345,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875.00,Outlet

In [9]:
# Check if any values are null.
combined_asa_rows.isnull().sum()

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [10]:
# Check the data type of each column.
combined_asa_rows.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [11]:
# Convert the "invoice_date" to a datetime datatype
# pd.to_datetime(combined_asa_rows["invoice_date"])
combined_asa_rows['invoice_date'] = pd.to_datetime(combined_asa_rows['invoice_date'], errors='coerce')

C:\Users\crumb\AppData\Local\Temp\ipykernel_17612\3687624109.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_asa_rows['invoice_date'] = pd.to_datetime(combined_asa_rows['invoice_date'], errors='coerce')

In [12]:
print(combined_asa_rows)

         retailer  retailer_id invoice_date     region         state  \
0     Foot Locker      1185732   2020-01-01  Northeast      New York
1     Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania
2     Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania
3     Foot Locker      1185732   2020-01-01  Northeast      New York
4     Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania
...           ...          ...          ...        ...           ...
8341  Foot Locker      1185732   2021-12-31  Northeast  Pennsylvania
8342  Foot Locker      1185732   2021-12-31  Northeast  Pennsylvania
8343       Amazon      1185732   2021-12-31  Northeast         Maine
8344       Amazon      1185732   2021-12-31  Northeast         Maine
8345  Foot Locker      1185732   2021-12-31  Northeast  Pennsylvania

              city                product  price_per_unit  units_sold  \
0         New York  Men's Street Footwear              50        1200
1     Philadelphia        Women's Apparel              68          83
2     Philadelphia        Women's Apparel              75         275
3         New York  Men's Street Footwear              34         384
4     Philadelphia        Women's Apparel              53          83
...            ...                    ...             ...         ...
8341  Philadelphia          Men's Apparel              63          47
8342  Philadelphia          Men's Apparel              46          56
8343      Portland          Men's Apparel              52          36
8344      Portland          Men's Apparel              55         125
8345  Philadelphia          Men's Apparel              70         175

      total_sales  operating_profit sales_method
0          600000         300000.00     In-store
1            5644           2426.92       Online
2          206250          61875.00       Outlet
3           13056           6789.12       Outlet
4            4399           1407.68       Outlet
...           ...               ...          ...
8341         2961           1362.06       Online
8342         2576           1004.64       Outlet
8343         1872            692.64       Online
8344        68750          17187.50       Outlet
8345       122500          42875.00       Outlet

[9643 rows x 12 columns]

In [13]:
# Confirm that the "invoice_date" data type has been changed.
combined_asa_rows.loc[:, 'invoice_date'].head()

0   2020-01-01
1   2020-01-01
2   2020-01-01
3   2020-01-01
4   2020-01-01
Name: invoice_date, dtype: datetime64[ns]

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [14]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
# total_products_sold = combined_asa_rows_null.loc[df['region'].sum, df['state'].sum, df['city'].sum]
#total_products_sold = pd.DataFrame({
    #'units_sold': df[df['region'].isin(combined_asa_rows)].groupby('region')['units_sold'].sum(),
    #'units_sold': df[df['state'].isin(combined_asa_rows)].groupby('state')['units_sold'].sum(),
    #'units_sold': df[df['city'].isin(combined_asa_rows)].groupby('city')['units_sold'].sum()
#})
total_products_sold = combined_asa_rows.groupby(['region', 'state', 'city'])["units_sold"].agg(Total_Products_Sold = ('sum'))

# Show the top 5 results.
total_products_sold.sort_values(by = (['Total_Products_Sold']), ascending=False).head()

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

#### Using `pivot_table`

In [15]:
# Show the number products sold for region, state, and city.
total_products_sold = pd.pivot_table(combined_asa_rows, 
                                 index=['region', 'state', 'city'],
                                 values='units_sold', 
                                 aggfunc='sum')
# Rename the "units_sold" column to "Total_Products_Sold"
tps = total_products_sold.rename(columns={'units_sold': 'Total_Products_Sold'})

# Show the top 5 results.
tps.sort_values(by = ('Total_Products_Sold'), ascending=False).head()

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [16]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
total_sales = combined_asa_rows.groupby(['region', 'state', 'city'])["total_sales"].agg(Total_Sales = ('sum'))

# Show the top 5 results.
total_sales.sort_values(by = (['Total_Sales']), ascending=False).head()

                                        Total_Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

#### Using `pivot_table`

In [17]:
# Show the total sales for the products sold for each region, state, and city.
total_sales = pd.pivot_table(combined_asa_rows, 
                                 index=['region', 'state', 'city'],
                                 values='total_sales', 
                                 aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
ts = total_sales.rename(columns={'total_sales': 'Total_Sales'})

# Show the top 5 results.
ts.sort_values(by = ('Total_Sales'), ascending=False).head()

                                        Total_Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [18]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
sales_total = combined_asa_rows.groupby(['retailer', 'region', 'state', 'city'])["total_sales"].agg(Total_Sales = ('sum'))

# Show the top 5 results.
sales_total.sort_values(by = 'Total_Sales', ascending=False).head()

                                                    Total_Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

#### Using `pivot_table`

In [19]:
# Show the total sales for the products sold for each retailer, region, state, and city.
sales_total = pd.pivot_table(combined_asa_rows, 
                                 index=['retailer', 'region', 'state', 'city'],
                                 values='total_sales', 
                                 aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
st = sales_total.rename(columns={'total_sales': 'Total_Sales'})

# Show the top 5 results.
st.sort_values(by = (['Total_Sales']), ascending=False).head()

                                                    Total_Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [20]:
# Filter the sales data to get the women's athletic footwear sales data.
womens_af_sales_df = combined_asa_rows[combined_asa_rows["product"].str.contains("Women's Athletic Footwear")]

#### Using `groupby`

In [21]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
wafw_sales_total = womens_af_sales_df.groupby(['retailer', 'region', 'state', 'city'])["units_sold"].agg(Womens_Footwear_Units_Sold = ('sum'))
#wafw_sales_tal.rename(index={'units_sold': 'Womens_Footwear_Units_Sold'})
# Show the top 5 results.
wafw_sales_total.sort_values(by = (['Womens_Footwear_Units_Sold']), ascending=False).head()

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

#### Using `pivot_table`

In [23]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
wafw_sales_total = pd.pivot_table(womens_af_sales_df, 
                                 index=['retailer', 'region', 'state', 'city'],
                                 values='units_sold', 
                                 aggfunc='sum')

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
wafw_sales_total.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace = True)
# Show the top 5 results.
wafw_sales_total.sort_values(by = (['Womens_Footwear_Units_Sold']), ascending=False).head()

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [27]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
sales_day = pd.pivot_table(combined_asa_rows, 
                                 index=['invoice_date'],
                                 values='total_sales', 
                                 aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
sales_day.rename(columns={'total_sales': 'Total Sales'}, inplace = True)

# Show the table.
sales_day

              Total Sales
invoice_date
2020-01-01         845141
2020-01-02         689410
2020-01-03         632573
2020-01-04         615080
2020-01-05         707829
...                   ...
2021-12-27         602353
2021-12-28         301010
2021-12-29         211109
2021-12-30         167903
2021-12-31         198659

[723 rows x 1 columns]

In [28]:
# Resample the pivot table into daily bins, and get the total sales for each day.
sd = sales_day.resample('D').sum()
#sales_day[""] = pd.cut(sales_day[""], 
                                              #bins, labels=, 
                                              #include_lowest=False)
#sales_day

# Sort the resampled pivot table in ascending order on "Total Sales".
sd.sort_values(by = 'Total Sales', ascending=False).head(10)

              Total Sales
invoice_date
2021-07-16       12261098
2021-12-16       10871121
2021-06-17       10239903
2021-08-17        9517031
2021-07-23        7689134
2021-11-17        7298791
2021-12-09        7257917
2020-04-24        7050982
2021-07-09        6854359
2021-06-24        6428692

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [29]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
sales_week = sd.resample('W').sum()
#sales_week[""] = pd.cut(sales_day[""], 
                                              #bins, labels=, 
                                              #include_lowest=False)
#sales_week

# Sort the resampled pivot table in ascending order on "Total Sales".
sales_week.sort_values(by = 'Total Sales', ascending=False).head(10)

              Total Sales
invoice_date
2021-07-11       26271380
2021-07-18       24731702
2021-12-19       24698535
2021-12-12       23250286
2021-08-22       22225401
2021-08-15       22037822
2021-06-13       21183998
2021-05-16       19779030
2021-07-25       19581545
2021-06-20       19085993